{
  "changeMetadata": {
    "title": "Configure Proof-of-Value exercise with FinOut as Cloud Cost Management platform",
    "customerNames": [
      "MCG",
      "MHK"
    ],
    "customerCodes": [
      "mcg",
      "mhk"
    ],
    "tickets": {
      "serviceNow": "CHG0315896",
      "jira": "HTSCCOE-7615"
    },
    "changeReason": "As part of our standard process of continual improvement, we are always on the lookout for new tools and platforms to increase the value and quality of our services.\n\nAlthough CloudHealth is our current platform for tracking, reporting, and driving cost savings on cloud spend across the enterprise we are always open to investigating potential future cloud cost platforms.",
    "implementationPlan": "The CCOE has already completed the necessary paperwork for GRC and OGC review of the vendor. The CCOE’s next step is to setup a copy of our cloud billing records for ingestion into the FinOut platform, and will then deploy a service account into each of our cloud providers so that the platform can scan the metadata of our cloud resources. Finally, CCOE will setup and configure Single Sign On to the FinOut platform.\n\n",
    "testPlan": "CCOE will check to see if billing records were ingested into the FinOut platform and if cloud resource metadata is available.\n\n",
    "expectedCustomerImpact": "This is an internal POV exercise and no customer impact is expected.\n\n",
    "rollbackPlan": "This is a net-new implementation, so rollback from various circumstances could be different depending on the issue. Billing records can be deleted and regenerated if necessary, the service account for gathering metadata can be deleted and re-injected, and the Single Sign On configuration can be deleted and re-configured.\n\n",
    "schedule": {
      "implementationStart": "2025-09-19T10:00",
      "implementationEnd": "2025-09-19T17:00",
      "beginDate": "2025-09-19",
      "beginTime": "10:00",
      "endDate": "2025-09-19",
      "endTime": "17:00",
      "timezone": "America/New_York"
    }
  },
  "emailNotification": {
    "subject": "ITSM Change Notification: Configure Proof-of-Value exercise with FinOut as Cloud Cost Management platform",
    "customerNames": [
      "MCG",
      "MHK"
    ],
    "customerCodes": [
      "mcg",
      "mhk"
    ],
    "scheduledWindow": {
      "start": "2025-09-19T10:00",
      "end": "2025-09-19T17:00"
    },
    "tickets": {
      "snow": "CHG0315896",
      "jira": "HTSCCOE-7615"
    }
  },
  "generatedAt": "2025-09-19T18:15:44.976Z",
  "generatedBy": "ITSM Metadata Collector",
  "meetingInvite": {
    "title": "Change Implementation: Configure Proof-of-Value exercise with FinOut as Cloud Cost Management platform",
    "startTime": "2025-09-19T10:00",
    "duration": 60,
    "attendees": [],
    "location": "Microsoft Teams"
  }
}